In [ ]:
overall = pd.merge(df_sales_customers_product_store, dfcur, how='inner', left_on=['Order Date', 'Currency Code'], right_on=['Date', 'Currency'])

In [4]:
import pandas as pd

In [3]:
dfsales =pd.read_csv("C:/Users/anbar/OneDrive/Desktop/Global electronics/df_sales.csv")
dfsales

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,NaN,265598,10,1304,1,CAD
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD
...,...,...,...,...,...,...,...,...,...
62879,2243030,1,2021-02-20,NaN,1216913,43,632,3,USD
62880,2243031,1,2021-02-20,2021-02-24,511229,0,98,4,EUR
62881,2243032,1,2021-02-20,2021-02-23,331277,0,1613,2,CAD
62882,2243032,2,2021-02-20,2021-02-23,331277,0,1717,2,CAD
62883,2243032,3,2021-02-20,2021-02-23,331277,0,464,7,CAD

In [12]:
dfsales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 62884 entries, 0 to 62883
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Order Number   62884 non-null  int64
 1   Line Item      62884 non-null  int64
 2   Order Date     62884 non-null  datetime64[ns]
 3   Delivery Date  13165 non-null  datetime64[ns]
 4   CustomerKey    62884 non-null  int64
 5   StoreKey       62884 non-null  int64
 6   ProductKey     62884 non-null  int64
 7   Quantity       62884 non-null  int64
 8   Currency Code  62884 non-null  object
dtypes: datetime64[ns](2), int64(6), object(1)
memory usage: 4.3+ MB

In [8]:
dfsales['Order Date']=pd.to_datetime(dfsales['Order Date'],format="%Y-%m-%d")

In [9]:
dfsales['Delivery Date']=pd.to_datetime(dfsales['Delivery Date'],format="%Y-%m-%d")

In [10]:
dfsales['Delivery Date']=dfsales['Delivery Date'].replace(0, pd.NaT)

In [11]:
dfsales['Order Date']=dfsales['Order Date'].replace(0, pd.NaT)

In [13]:
dfcurrency =pd.read_csv("C:/Users/anbar/OneDrive/Desktop/Global electronics/df_currency.csv")
dfcurrency

             Date Currency  Exchange
0      2015-01-01      USD    1.0000
1      2015-01-01      CAD    1.1583
2      2015-01-01      AUD    1.2214
3      2015-01-01      EUR    0.8237
4      2015-01-01      GBP    0.6415
...           ...      ...       ...
11210  2021-02-20      USD    1.0000
11211  2021-02-20      CAD    1.2610
11212  2021-02-20      AUD    1.2723
11213  2021-02-20      EUR    0.8238
11214  2021-02-20      GBP    0.7126

[11215 rows x 3 columns]

In [19]:
dfcurrency.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11215 entries, 0 to 11214
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      11215 non-null  datetime64[ns]
 1   Currency  11215 non-null  object
 2   Exchange  11215 non-null  float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 263.0+ KB

In [18]:
dfcurrency['Date']=pd.to_datetime(dfcurrency['Date'],format="%Y-%m-%d")

In [14]:
dfcurrency['Date'].isna().sum()

np.int64(0)

In [20]:
Df_salcurr = pd.merge(dfsales, dfcurrency, how='inner', left_on=['Order Date', 'Currency Code'], right_on=['Date', 'Currency'])

In [21]:
path=r"C:/Users/anbar/OneDrive/Desktop/Global electronics/Df_sales_currency.csv"
Df_salcurr.to_csv(path,index=False)

In [23]:
pd.set_option('display.max_rows', None) 
Df_salcurr

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv("C:/Users/anbar/OneDrive/Desktop/Global electronics/Df_sales_currency.csv")

In [4]:
df.head()

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Date,Currency,Exchange
0,366000,1,2016-01-01,NaN,265598,10,1304,1,CAD,2016-01-01,CAD,1.3884
1,366001,1,2016-01-01,2016-01-13,1269051,0,1048,2,USD,2016-01-01,USD,1.0000
2,366001,2,2016-01-01,2016-01-13,1269051,0,2007,1,USD,2016-01-01,USD,1.0000
3,366002,1,2016-01-01,2016-01-12,266019,0,1106,7,CAD,2016-01-01,CAD,1.3884
4,366002,2,2016-01-01,2016-01-12,266019,0,373,1,CAD,2016-01-01,CAD,1.3884

In [5]:
#connecting with database
import mysql.connector
mydb = mysql.connector.connect(
 host="localhost",
 user="root",
 password="Sql@10",


)


print(mydb)
mycursor = mydb.cursor(buffered=True)

<mysql.connector.connection_cext.CMySQLConnection object at 0x000002295CB1D730>

In [6]:
mycursor.execute("use globalelectronics")

In [7]:
mycursor.execute("create table salesandexchange (ordernumber int,lineitem int,orderdate date,deliverydate date,customerkey int,storekey int,productkey int,quantity int,currencycode varchar(50),dates date,currency varchar(50),exchange decimal(10,6))")

In [7]:
insert_query = '''
INSERT INTO salesandexchange(ordernumber, lineitem, orderdate, deliverydate, customerkey,storekey,productkey,quantity,currencycode,dates,currency,exchange)
VALUES (%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)
'''

In [8]:
df=df.fillna(0)

In [9]:
df['Delivery Date']=df['Delivery Date'].replace(0, pd.NaT)

In [10]:
df=df.values.tolist()

In [11]:
df
a=[tuple(i) for i in df]

In [12]:
mycursor.executemany(insert_query,a)
mydb.commit()